; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v13)
             (pred_12 ?v11 ?v3)
             (pred_8 ?v8 ?v3)
             (pred_2 ?v1 ?v8 )
	     (pred_1 ?v8)
             (pred_10 ?v9)
             (pred_9 ?v11)
             (pred_4 ?v3)
             (pred_11 ?v8)
             (pred_5 ?v11)
             (pred_7 ?v8)
             (pred_3 ))



(:action op_5
:parameters (?v6 ?v5 ?v7 ?v2)
:precondition (and (pred_10 ?v6) (pred_10 ?v5) (pred_9 ?v7) (pred_4 ?v2)
          (pred_6 ?v6 ?v5) (pred_12 ?v7 ?v2)
                   (pred_8 ?v5 ?v2) (pred_1 ?v6) 
                   (pred_11 ?v5) (pred_5 ?v7))
:effect (and  (pred_7 ?v5) (not (pred_11 ?v5))))


(:action op_1
:parameters (?v6 ?v12)
:precondition (and (pred_10 ?v6) (pred_10 ?v12)
               (pred_1 ?v6) (pred_6 ?v6 ?v12) (pred_7 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v6))))

(:action op_4
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_9 ?v7) 
                  (pred_1 ?v6) (pred_2 ?v7 ?v6) (pred_3 ))
:effect (and (pred_5 ?v7)
   (not (pred_2 ?v7 ?v6)) (not (pred_3 ))))


(:action op_2
:parameters (?v6 ?v10 ?v4)
:precondition (and (pred_10 ?v6) (pred_9 ?v10) (pred_9 ?v4)
                  (pred_1 ?v6) (pred_5 ?v4) (pred_2 ?v10 ?v6))
:effect (and (pred_5 ?v10) (pred_2 ?v4 ?v6)
        (not (pred_5 ?v4)) (not (pred_2 ?v10 ?v6))))

(:action op_3
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_9 ?v7) 
                  (pred_1 ?v6) (pred_5 ?v7))
:effect (and (pred_3 ) (pred_2 ?v7 ?v6) (not (pred_5 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_01 obj_18 obj_13 obj_28 obj_04 obj_25 obj_30 obj_15 obj_23 obj_10 obj_26 obj_24 obj_08 obj_16 obj_19 obj_05 obj_22 obj_07 obj_27 obj_20 obj_14 obj_11 obj_03 obj_17
    obj_29 obj_12
    obj_02 obj_21 obj_06
    )

    (:init
       (pred_3)

       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_28)
       (pred_10 obj_04)
       (pred_10 obj_25)
       (pred_10 obj_30)
       (pred_10 obj_15)
       (pred_10 obj_23)
       (pred_10 obj_10)
       (pred_10 obj_26)
       (pred_10 obj_24)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_22)
       (pred_10 obj_07)
       (pred_10 obj_27)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_4 obj_29)
       (pred_4 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_21)
       (pred_9 obj_06)

       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_01 obj_25)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_18 obj_30)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_13 obj_28)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_28 obj_13)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_25 obj_30)
       (pred_6 obj_25 obj_01)
       (pred_6 obj_25 obj_04)
       (pred_6 obj_30 obj_24)
       (pred_6 obj_30 obj_15)
       (pred_6 obj_30 obj_18)
       (pred_6 obj_30 obj_25)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_15 obj_23)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_30)
       (pred_6 obj_23 obj_16)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_23 obj_15)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_26)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_26 obj_24)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_10)
       (pred_6 obj_24 obj_22)
       (pred_6 obj_24 obj_08)
       (pred_6 obj_24 obj_30)
       (pred_6 obj_24 obj_26)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_08 obj_24)
       (pred_6 obj_16 obj_27)
       (pred_6 obj_16 obj_23)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_22 obj_11)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_22 obj_24)
       (pred_6 obj_22 obj_05)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_27)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_27 obj_17)
       (pred_6 obj_27 obj_16)
       (pred_6 obj_27 obj_07)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_22)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_17 obj_27)
       (pred_6 obj_17 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_14)
       (pred_8  obj_04 obj_29)
       (pred_8  obj_15 obj_12)
       (pred_8  obj_14 obj_29)
       (pred_7 obj_09)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_28)
       (pred_7 obj_25)
       (pred_7 obj_30)
       (pred_7 obj_23)
       (pred_7 obj_10)
       (pred_7 obj_26)
       (pred_7 obj_24)
       (pred_7 obj_08)
       (pred_7 obj_16)
       (pred_7 obj_19)
       (pred_7 obj_05)
       (pred_7 obj_22)
       (pred_7 obj_07)
       (pred_7 obj_27)
       (pred_7 obj_20)
       (pred_7 obj_11)
       (pred_7 obj_03)
       (pred_7 obj_17)

       (pred_12  obj_02 obj_29)
       (pred_12  obj_21 obj_12)
       (pred_12  obj_06 obj_29)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_06 obj_01)
       (pred_1 obj_11)
    )

    (:goal (and
       (pred_2 obj_02 obj_18)
    ))
(:constraints
  (always (not (pred_1 obj_26)))
)
)

; plan
1. (op_1 obj_11 obj_22)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_22)
   goals met: 0 of 1
2. (op_1 obj_22 obj_05)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_05)
   goals met: 0 of 1
3. (op_1 obj_05 obj_19)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_19)
   goals met: 0 of 1
4. (op_1 obj_19 obj_10)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_02)
   deleted: (pred_2 obj_02 obj_10) (pred_3)
   added: (pred_5 obj_02)
   goals met: 0 of 1
6. (op_5 obj_10 obj_04 obj_02 obj_29)
   deleted: (pred_11 obj_04)
   added: (pred_7 obj_04)
   goals met: 0 of 1
7. (op_1 obj_10 obj_04)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_09)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_09)
   goals met: 0 of 1
9. (op_1 obj_09 obj_01)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_01)
   goals met: 0 of 1
10. (op_1 obj_01 obj_18)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_18)
   goals met: 0 of 1
11. (op_3 obj_18 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_3) (pred_2 obj_02 obj_18)
   goals met: 1 of 1
